eg:
include "stdio"   //预处理命令
main()            // 主函数
{                 //{}里面为执行代码
int a,b,sum;      //定义三个整型变量
a=1;              //将1赋值给a
b=2;              //将b赋值给b
sum=a+b;          //将a+b赋值给sum
printf("sum=%d\n",sum);   //输出结果    \n为换行
}

//上面为C的一个基本程序，下面为C语言的知识

/*******C语言的结构*********/
include <stdio.h>  //预处理命令，调用stdio.h库文件进行编译
main()       //主函数，一个C程序有且只有一个主函数，并且每个程序都必须包含这个结构，执行代码里可以为空
{            //函数体在{}里，该部分为计算机需要执行的单元
  执行部分；         //执行单元
}

/*******变量赋值********/
int a;       
    a=1;    //此处为先定义了一个变量a,再给变量赋值
int a=1;    //定义变量的同时赋值
int a,b,c..； //此处为定义多个变量
//变量赋值的一般形式为：数据类型 变量名；可多个变量一起定义数据类型。但是不可多个变量同时赋值

/*******基本数据类型*****/
int，short int,long int, unsigned int, unsigned short int,unsigned long int    //整形
//int short int long int是根据编译环境的不同，所取范围不同。
//short int和long int至少是表中所写范围, 但是int在表中是以16位编译环境写的取值范围。
//c语言int的取值范围在于他占用的字节数 ，不同的编译器，规定是不一样。
//ANSI标准定义int是占2个字节，TC是按ANSI标准的，它的int是占2个字节的。但是在VC里，一个int是占4个字节的。
float，double   //字符型（浮点型）
//C语言中不存在字符串变量，字符串只能存在字符数组中  




















